# -----------------------------------------------------------------------------
#                                   Задача
# 8.2 Закодируйте любую строку из трех слов по алгоритму Хаффмана.
# -----------------------------------------------------------------------------
# Для полноценной проверки нужны повторяющиеся символы.
# Для большей наглядности и сокращения объема данных исходный букварь ограничен символами ABCDEFGH
#
# -----------------------------------------------------------------------------
#                                     Данные
import random as rand

words_1 = ['Аист', 'Берёза', 'Вася', 'Годзилла', 'Дочка',
           'Ёжик', 'Жена', 'Зёбра', 'Игнат', 'Кеша',
           'Ласка', 'Мама', 'Носорог', 'Петя', 'Тётя']
words_2 = ['атакует', 'баюкает', 'возит', 'гладит', 'готовит',
           'зовёт', 'игнорит', 'любит', 'моет', 'мучает',
           'кушает', 'пинает', 'ненавидит', 'приветствует', 'тащит']
words_3 = ['атлетику', 'бобров', 'девочек', 'годзиллу', 'дурачка',
           'ёжиков', 'жижу', 'занятия', 'забор', 'коров',
           'пинки', 'раму', 'носорога', 'чуждое', 'хлам']


def rnd(a: list, b: list, c: list):
    return ''.join([a[rand.randint(0, len(a)-1)], ' ', b[rand.randint(0, len(b)-1)], ' ', c[rand.randint(0, len(c)-1)]])


# -----------------------------------------------------------------------------
#                                    Генератор весов
def get_weights(st: str):
    wt = {}
    for s in st:
        if s in wt:
            wt[s] += 1
        else:
            wt[s] = 1
    wt = sorted(wt.items(), key=lambda x: x[1])
    return wt


# -----------------------------------------------------------------------------
#  Распускаем стринг на подстринги, проверяем часть в общем через хеш, исключаем повтор
# def


# -----------------------------------------------------------------------------
#                                      main func
def main(st: str):
    print(f'{st=}')
    w_dict = get_weights(st)
    print(f'{w_dict=} ')


# -----------------------------------------------------------------------------
#
main(rnd(words_1, words_2, words_3))
